holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
/** -------------------------------------------------------------------------------------
 * SatIO LVGL - Written by Benjamin Jack Cullen.
 */

#include "bsp/esp32_p4_wifi6_touch_lcd_xc.h"
#include <limits.h>
#include "esp_log.h"
#include "lvgl.h"
#include <stdlib.h>
#include "ff.h"
#include "diskio.h"
#include "diskio_impl.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include "driver/sdmmc_host.h"
#include "esp_err.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"
#include <stdio.h>
#include <dirent.h>
#include "bsp/esp-bsp.h"

#include <stdio.h>
#include <limits.h>
#include <string.h>
#include <assert.h>
#include <float.h>
#include <math.h>
#include <Arduino.h>

#include "./config.h"
#include "./REG.h"
#include "./strval.h"
#include "./meteors.h"
#include "./wtgps300p.h"
#include "./wt901.h"
#include "./multiplexers.h"
#include "./sidereal_helper.h"
#include "./hextodig.h"
#include "./ins.h"
#include "./satio.h"
#include "./custommapping.h"
#include "./matrix.h"
#include "./serial_infocmd.h"
#include "./system_data.h"
#include "./sdcard_helper.h"
#include "./task_handler.h"
// #include "./multi_display_controller.h"
#include "./i2c_helper.h"
#include "./wit_c_sdk.h"
#include "./astroclock.h"
#include "./satio_file.h"

#include <sys/time.h>
#include <rtc_wdt.h>
#include <esp_task_wdt.h>
#include "esp_pm.h"
#include "esp_attr.h"
#include "esp_log.h"
#include "esp_partition.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_partition.h"
#include "esp_spiffs.h"
#include "esp_heap_caps.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "driver/uart.h"

#include "./satio_lvgl.h"

/** ---------------------------------------------------------------------------------------
 * @brief Screens
 */

lv_timer_t * display_timer=NULL;

lv_obj_t * loading_screen;
lv_obj_t * home_screen;
lv_obj_t * matrix_screen;
lv_obj_t * gps_screen;
lv_obj_t * gyro_screen;
lv_obj_t * serial_screen;
lv_obj_t * mplex0_screen;
lv_obj_t * uap_screen;

int32_t current_screen_number = -1;
#define LOAD_SCREEN    -1
#define HOME_SCREEN    0
#define MATRIX_SCREEN  1
#define GPS_SCREEN     2
#define GYRO_SCREEN    3
#define MPLEX0_SCREEN  4
#define SERIAL_SCREEN  5
#define UAP_SCREEN     6

bool flag_display_loading_screen = false;
bool flag_display_home_screen = false;
bool flag_display_matrix_screen = false;
bool flag_display_gps_screen = false;
bool flag_display_gyro_screen = false;
bool flag_display_mplex0_screen = false; 
bool flag_display_serial_screen = false;
bool flag_display_uap_screen = false;

/** ---------------------------------------------------------------------------------------
 * @brief Global Objects
 */

// ---------------------------
// Loading screen image
// ---------------------------
static sdcard_image_t * loading_image = NULL;
// ---------------------------
// Keyboards
// ---------------------------
keyboard_t kb_numdec;
keyboard_t kb_alnumsym;
// ---------------------------
// System Tray
// ---------------------------
system_tray_t system_tray;
lv_obj_t * slider_brightness;
int32_t slider_brightness_value = 0;
int32_t slider_outline_width = 2;
// ---------------------------
// Title Bar
// ---------------------------
title_bar_t main_title_bar;
// ---------------------------
// Matrix
// ---------------------------
#define MAX_MATRIX_PANEL_VIEWS 3
#define MATRIX_SWITCH_PANEL_NUMBER_OVERVIEW 0
#define MATRIX_SWITCH_PANEL_NUMBER_MATRIX   1
#define MATRIX_SWITCH_PANEL_NUMBER_MAPPING  2
int current_matrix_panel_view=0;
int current_matrix_i = 0;
int current_mapping_i = 0;
int current_matrix_function_i = 0;
lv_obj_t * matrix_overview_grid_1;
matrix_function_container_t mfc;
mapping_config_container_t mcc;
button_t matrix_new;
button_t matrix_save;
button_t matrix_load;
button_t matrix_delete;
lv_obj_t * dd_matrix_file_slot_select;
matrix_switch_container_t matrix_switch_panel;
// ---------------------------
// GPS
// ---------------------------
gngga_container_t gngga_c;
gnrmc_container_t gnrmc_c;
gpatt_container_t gpatt_c;
satio_container_t satio_c;
gps_switch_container_t gps_switch_panel;
int current_gps_panel=0;
#define MAX_GPS_PANEL_VIEWS 4
// ---------------------------
// Gyro
// ---------------------------
gyro_0_container_t gyro_0_c;
// ---------------------------
// Admplex 0
// ---------------------------
admplex0_container_t admlpex0_c;
// ---------------------------
// Serial
// ---------------------------
serial_container_t serial_c;
// ---------------------------
// UAP
// ---------------------------
uap_t uap_c;

/** ---------------------------------------------------------------------------------------
 * @brief Global Style
 */

// ---------------------------
// Size
// ---------------------------
int32_t outline_width = 2;
int32_t border_width  = 0;
int32_t shadow_width  = 0;

int32_t general_menu_w_px = 550;
int32_t general_menu_h_px = 400;
int32_t general_menu_row_h_px = 42;
int32_t interactive_menu_row_h_px = 48;

// ---------------------------
// Radius
// ---------------------------
int32_t radius_square  = 0;
int32_t radius_rounded = 5;
int32_t radius_circle  = 360;
int32_t general_radius = 0;
// ---------------------------
// Current Hue
// ---------------------------
uint32_t current_hue=0;
// ---------------------------
// Rainbow Color
// ---------------------------
lv_color_t rainbow_outline_hue;
lv_color_t rainbow_title_hue;
lv_color_t rainbow_value_hue;
// ---------------------------
// Rainbow Contrast Color
// ---------------------------
lv_color_t rainbow_contrast_outline_hue;
lv_color_t rainbow_contrast_title_hue;
lv_color_t rainbow_contrast_value_hue;
// ---------------------------
// Default Color
// ---------------------------
lv_color_t default_bg_hue;
lv_color_t default_bg_title_hue;
lv_color_t default_outline_hue;
lv_color_t default_border_hue;
lv_color_t default_shadow_hue;
lv_color_t default_title_hue;
lv_color_t default_subtitle_hue;
lv_color_t default_value_hue;
// ---------------------------
// Default Button
// ---------------------------
lv_color_t default_btn_bg;
lv_color_t default_btn_outline_hue;
lv_color_t default_btn_border_hue;
lv_color_t default_btn_shadow_hue;
lv_color_t default_btn_value_hue;
// ---------------------------
// Default Button Off
// ---------------------------
lv_color_t default_btn_off_bg;
lv_color_t default_btn_off_outline_hue;
lv_color_t default_btn_off_border_hue;
lv_color_t default_btn_off_shadow_hue;
lv_color_t default_btn_off_value_hue;
// ---------------------------
// Default Button On
// ---------------------------
lv_color_t default_btn_on_bg;
lv_color_t default_btn_on_outline_hue;
lv_color_t default_btn_on_border_hue;
lv_color_t default_btn_on_shadow_hue;
lv_color_t default_btn_on_value_hue;
// ---------------------------
// Default Button Toggle
// ---------------------------
lv_color_t default_btn_toggle_outline_hue;
lv_color_t default_btn_toggle_value_hue;

// ---------------------------
// Default Switch
// ---------------------------
lv_color_t default_sw_off_bg;
lv_color_t default_sw_off_knob_bg;
lv_color_t default_sw_on_bg;
lv_color_t default_sw_on_knob_bg;

// ---------------------------
// Custom Color
// ---------------------------
lv_color_t custom_bg_hue;
lv_color_t custom_title_bg_hue;
lv_color_t custom_outline_hue;
lv_color_t custom_border_hue;
lv_color_t custom_shadow_hue;
lv_color_t custom_title_hue;
lv_color_t custom_subtitle_hue;
lv_color_t custom_value_hue;
// -------------------------------------
// Current Color (set as default/custom)
// -------------------------------------
lv_color_t main_bg_hue;
lv_color_t main_title_bg_hue;
lv_color_t main_outline_hue;
lv_color_t main_border_hue;
lv_color_t main_shadow_hue;
lv_color_t main_title_hue;
lv_color_t main_subtitle_hue;
lv_color_t main_value_hue;

