holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        printf("[matrix_new_event_cb] Setting new matrix.\n");
        override_all_computer_assists();
        set_all_matrix_default();
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void matrix_save_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_save_event_cb] Saving matrix to slot: %d\n", satioFileData.i_current_matrix_file_path);
            sdcardFlagData.save_matrix=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.save_mapping=true;
        }
        else {
            printf("[matrix_save_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void matrix_load_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_load_event_cb] Loading matrix from slot: %d\n", satioFileData.i_current_matrix_file_path);
            sdcardFlagData.load_mapping=true;
            vTaskDelay(1000 / portTICK_PERIOD_MS);
            sdcardFlagData.load_matrix=true;
        }
        else {
            printf("[matrix_load_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void matrix_delete_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        if (sdcardData.sdcard_mounted==true) {
            printf("[matrix_delete_event_cb] Deleting matrix in slot: %d\n", satioFileData.i_current_matrix_file_path);
            sdcardFlagData.delete_matrix=true;
        }
        else {
            printf("[matrix_delete_event_cb] sdcard is not mounted.");
        }
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void current_matrix_computer_assist_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        bool toggle = !matrixData.computer_assist[0][current_matrix_i];
        matrixData.computer_assist[0][current_matrix_i] = toggle;
        printf("[current_matrix_computer_assist_event_cb] Setting computer assist for matrix switch %d to: %s\n", current_matrix_i, toggle ? "true" : "false");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_matrix_overview_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_matrix_panel_view=MATRIX_SWITCH_PANEL_NUMBER_OVERVIEW;
        printf("[switch_matrix_overview_panel_event_cb] Switching matrix panel: %d\n", current_matrix_panel_view);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_matrix_matrix_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_matrix_panel_view=MATRIX_SWITCH_PANEL_NUMBER_MATRIX;
        printf("[switch_matrix_matrix_panel_event_cb] Switching matrix panel: %d\n", current_matrix_panel_view);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_matrix_mapping_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_matrix_panel_view=MATRIX_SWITCH_PANEL_NUMBER_MAPPING;
        printf("[switch_matrix_mapping_panel_event_cb] Switching matrix panel: %d\n", current_matrix_panel_view);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_satio_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=0;
        printf("[switch_satio_panel_event_cb] Switching to SatIO panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_gngga_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=1;
        printf("[switch_gngga_panel_event_cb] Switching to GNGGA panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_gnrmc_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=2;
        printf("[switch_gnrmc_panel_event_cb] Switching to GNRMC panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void switch_gpatt_panel_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

