holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        current_gps_panel=3;
        printf("[switch_gpatt_panel_event_cb] Switching to GPATT panel.\n");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void current_matrix_override_off_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        printf("[current_matrix_override_off_event_cb] OVERRIDING matrix switch %d\n", current_matrix_i);
        setOverrideOutputValue((int)current_matrix_i, (uint32_t)0);
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_location_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.location_value_mode = SATIO_MODE_GPS;
        printf("[btn_location_mode_gps_event_cb] Setting location value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_location_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.location_value_mode = SATIO_MODE_USER;
        printf("[btn_location_mode_user_event_cb] Setting location value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_altitude_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_GPS;
        printf("[btn_altitude_mode_gps_event_cb] Setting altitude value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_altitude_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.altitude_value_mode = SATIO_MODE_USER;
        printf("[btn_altitude_mode_user_event_cb] Setting altitude value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_speed_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_GPS;
        printf("[btn_speed_mode_gps_event_cb] Setting speed value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_speed_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.speed_value_mode = SATIO_MODE_USER;
        printf("[btn_speed_mode_user_event_cb] Setting speed value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_ground_heading_mode_gps_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.ground_heading_value_mode = SATIO_MODE_GPS;
        printf("[btn_ground_heading_mode_gps_event_cb] Setting ground heading value mode SATIO_MODE_GPS");
    }
}
/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_ground_heading_mode_user_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.ground_heading_value_mode = SATIO_MODE_USER;
        printf("[btn_ground_heading_mode_user_event_cb] Setting ground heading value mode SATIO_MODE_USER");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_lat_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_degrees_latitude = satioData.degrees_latitude;
        printf("[btn_auto_set_user_lat_event_cb] Auto set data.");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_lon_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_degrees_longitude = satioData.degrees_longitude;
        printf("[btn_auto_set_user_lon_event_cb] Auto set data.");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_altitude_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_altitude = satioData.altitude;
        printf("[btn_auto_set_user_altitude_event_cb] Auto set data.");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_speed_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

