holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    if(code == LV_EVENT_CLICKED) {
        satioData.user_speed = satioData.speed;
        printf("[btn_auto_set_user_speed_event_cb] Auto set data.");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void btn_auto_set_user_ground_heading_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if(code == LV_EVENT_CLICKED) {
        satioData.user_ground_heading = satioData.ground_heading;
        printf("[btn_auto_set_user_ground_heading_event_cb] Auto set data.");
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Event callback.
 * 
 * @param e Pointer to the LVGL event structure.
 */
void sw_output_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if (code == LV_EVENT_VALUE_CHANGED)
    {
        lv_obj_t * sw = (lv_obj_t *)lv_event_get_target(e);

        bool is_enabled = lv_obj_has_state(sw, LV_STATE_CHECKED);

        if (sw == serial_c.sw_output_all) {
            setAllSentenceOutput(is_enabled);
            printf("[OUTPUT ALL] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_satio) {
            systemData.output_satio_enabled = is_enabled;
            printf("[OUTPUT SATIO] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_gngga) {
            systemData.output_gngga_enabled = is_enabled;
            printf("[OUTPUT GNGGA] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_gnrmc) {
            systemData.output_gnrmc_enabled = is_enabled;
            printf("[OUTPUT GNRMC] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_gpatt) {
            systemData.output_gpatt_enabled = is_enabled;
            printf("[OUTPUT GPATT] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_ins) {
            systemData.output_ins_enabled = is_enabled;
            printf("[OUTPUT INS] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_matrix) {
            systemData.output_matrix_enabled = is_enabled;
            printf("[OUTPUT MATRIX] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_input_controller) {
            systemData.output_input_portcontroller = is_enabled;
            printf("[OUTPUT INPUT CONTROLLER] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_admplex_0) {
            systemData.output_admplex0_enabled = is_enabled;
            printf("[OUTPUT ADMplex 0] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_gyro_0) {
            systemData.output_gyro_0_enabled = is_enabled;
            printf("[OUTPUT GYRO 0] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_sun) {
            systemData.output_sun_enabled = is_enabled;
            printf("[OUTPUT SUN] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_mercury) {
            systemData.output_mercury_enabled = is_enabled;
            printf("[OUTPUT MERCURY] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_venus) {
            systemData.output_venus_enabled = is_enabled;
            printf("[OUTPUT VENUS] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_earth) {
            systemData.output_earth_enabled = is_enabled;
            printf("[OUTPUT EARTH] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_luna) {
            systemData.output_luna_enabled = is_enabled;
            printf("[OUTPUT LUNA] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_mars) {
            systemData.output_mars_enabled = is_enabled;
            printf("[OUTPUT MARS] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_jupiter) {
            systemData.output_jupiter_enabled = is_enabled;
            printf("[OUTPUT JUPITER] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_saturn) {
            systemData.output_saturn_enabled = is_enabled;
            printf("[OUTPUT SATURN] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_uranus) {
            systemData.output_uranus_enabled = is_enabled;
            printf("[OUTPUT URANUS] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_neptune) {
            systemData.output_neptune_enabled = is_enabled;
            printf("[OUTPUT NEPTUNE] %s\n", is_enabled ? "Enabled" : "Disabled");}

        else if (sw == serial_c.sw_output_meteors) {
            systemData.output_meteors_enabled = is_enabled;
            printf("[OUTPUT METEORS] %s\n", is_enabled ? "Enabled" : "Disabled");}
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Create Title Bar.
 * 
 * @param parent Specify parent object.
 * @param size_w_px Panel width.
 * @param size_h_px Panel height
 * @param alignment Panel alignment on parent object.
 * @param pos_x Offset from alignment.
 * @param pos_y Offset from alignment.
 * @param show_scrollbar Show/hide scrollbar.
 * @param enable_scrolling Enable/disable scrolling.
 * @param font_title Specify title font.
 * @param font_subtitle Specify subtitle font.
 * @return title_bar_t.
 */
title_bar_t create_title_bar (
    lv_obj_t * parent,
    int32_t size_w_px,
    int32_t size_h_px,
    lv_align_t alignment,
    int32_t pos_x,
    int32_t pos_y,
    bool show_scrollbar,
    bool enable_scrolling,
    const lv_font_t * font_title,
    const lv_font_t * font_sub
    )
{
    // Initialize struct
    title_bar_t title_bar = {0};
    
    // Create title bar
    title_bar.panel = lv_obj_create(parent);

    // Show scrollbar
    if (show_scrollbar) {lv_obj_set_scrollbar_mode(title_bar.panel, LV_SCROLLBAR_MODE_AUTO);}
    else {lv_obj_set_scrollbar_mode(title_bar.panel, LV_SCROLLBAR_MODE_OFF);}

    // Enable scrolling
    if (enable_scrolling) {lv_obj_set_scroll_dir(title_bar.panel, LV_DIR_ALL);}
    else {lv_obj_set_scroll_dir(title_bar.panel, LV_DIR_NONE);}

    // Size and position
    lv_obj_set_size(title_bar.panel, size_w_px, size_h_px);
    lv_obj_align(title_bar.panel, alignment, pos_x, pos_y);

