holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_night_hours = create_label(
        row_LMST_night_hours,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Night Hours HH.MM",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_night_hours = create_label(
        row_LMST_night_hours,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_night_hours, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_night_hours, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Anomaly                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_anomaly = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_anomaly = create_label(
        row_LMST_anomaly,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Anomaly",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_anomaly = create_label(
        row_LMST_anomaly,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_anomaly, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_anomaly, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Current Twilight Zone Name                        */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_current_twilight_zone_name = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_current_twilight_zone_name = create_label(
        row_LMST_current_twilight_zone_name,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Current TZ",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_current_twilight_zone_name = create_label(
        row_LMST_current_twilight_zone_name,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_current_twilight_zone_name, obj_w_0, obj_height);
    lv_obj_set_size(result.val_current_twilight_zone_name, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Astronomical Twilight Dawn                         */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_astronomical_twilight_dawn = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_astronomical_twilight_dawn = create_label(
        row_LMST_astronomical_twilight_dawn,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Astro Twilight Dawn",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_astronomical_twilight_dawn = create_label(
        row_LMST_astronomical_twilight_dawn,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_astronomical_twilight_dawn, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_astronomical_twilight_dawn, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Nautical Twilight Dawn                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_nautical_twilight_dawn = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

