holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_FullDayLight = create_label(
        row_LMST_FullDayLight,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Full Day Light",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_FullDayLight = create_label(
        row_LMST_FullDayLight,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_FullDayLight, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_FullDayLight, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Golden Hour Dusk                                   */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_golden_hour_dusk = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_golden_hour_dusk = create_label(
        row_LMST_golden_hour_dusk,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Golden Hour Dusk",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_golden_hour_dusk = create_label(
        row_LMST_golden_hour_dusk,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_golden_hour_dusk, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_golden_hour_dusk, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Row LMST Sunset                                            */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_sunset = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_sunset = create_label(
        row_LMST_sunset,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Sunset HH.MM",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_sunset = create_label(
        row_LMST_sunset,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_sunset, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_sunset, obj_w_1, obj_height);


    /* ---------------------------------------------------------- */
    /* Row LMST Civil Twilight Dusk                                */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_civil_twilight_dusk = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    obj_w_0 = 250;
    obj_w_1 = sub_row_width - obj_w_0 - (sub_column_padding * 2);

    result.lbl_LMST_civil_twilight_dusk = create_label(
        row_LMST_civil_twilight_dusk,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "LMST Civil Twilight Dusk",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    result.val_LMST_civil_twilight_dusk = create_label(
        row_LMST_civil_twilight_dusk,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_value_hue
    );

    lv_obj_set_size(result.lbl_LMST_civil_twilight_dusk, obj_w_0, obj_height);
    lv_obj_set_size(result.val_LMST_civil_twilight_dusk, obj_w_1, obj_height);


    /* ---------------------------------------------------------- */
    /* Row LMST Nautical Twilight Dusk                             */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_LMST_nautical_twilight_dusk = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

