holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_obj_t * row_pwm0 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 55; // label
    obj_w_1 = (((sub_row_width/2) *1) - obj_w_0) - (sub_column_padding*2);
    obj_w_2 = 55;
    obj_w_3 = (((sub_row_width/2) *1) - obj_w_2) - (sub_column_padding*2);

    // Label PWM0
    result.label_output_pwm_0 = create_label(
        row_pwm0,             // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "PWM0",               // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Label PWM0
    result.val_pwm_0 = create_label(
        row_pwm0,             // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    lv_obj_add_flag(result.val_pwm_0, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(result.val_pwm_0, set_keyboard_context_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_set_user_data(result.val_pwm_0, &matrix_output_pwm_0_ctx);

    // Label PWM1
    result.label_output_pwm_1 = create_label(
        row_pwm0,             // parent
        obj_w_2,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "PWM1",               // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Value PWM1
    result.val_pwm_1 = create_label(
        row_pwm0,             // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                   // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    lv_obj_add_flag(result.val_pwm_1, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(result.val_pwm_1, set_keyboard_context_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_set_user_data(result.val_pwm_1, &matrix_output_pwm_1_ctx);

    // Critical for alignment
    lv_obj_set_size(result.label_output_pwm_0, obj_w_0, obj_height);
    lv_obj_set_size(result.val_pwm_0, obj_w_1, obj_height);
    lv_obj_set_size(result.label_output_pwm_1, obj_w_2, obj_height);
    lv_obj_set_size(result.val_pwm_1, obj_w_3, obj_height);

    /* --- Index Map Slot ------------------------------------------------ */
    
    lv_obj_t * row_port = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Set row object widths
    obj_w_0 = 35; // label
    obj_w_1 = (((sub_row_width/3) *1) - obj_w_0) - (sub_column_padding*2);
    obj_w_2 = 30;
    obj_w_3 = (((sub_row_width/3) *1) - obj_w_2) - (sub_column_padding*2);
    obj_w_4 = 30;
    obj_w_5 = (((sub_row_width/3) *1) - obj_w_2) - (sub_column_padding*2);

    // Label Map Slot
    result.label_map_slot = create_label(
        row_port,             // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Map",                // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    
    // Map Slot Value
    result.dd_map_slot = create_dropdown_menu(
        row_port,
        NULL,
        0,
        obj_w_1,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_map_slot_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MAP_SLOTS; i++) {
        snprintf(dd_map_slot_name, sizeof(dd_map_slot_name), "%s", String(i).c_str());
        lv_dropdown_add_option(result.dd_map_slot, dd_map_slot_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_map_slot, 0);
    lv_obj_add_event_cb(result.dd_map_slot, dd_link_map_slot_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Label 
    result.label_output_mode = create_label(
        row_port,             // parent
        obj_w_2,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Out",                // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Output Value
    result.dd_output_mode = create_dropdown_menu(
        row_port,
        NULL,
        0,
        obj_w_3,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        font_sub
    );
    char dd_output_mode_name[MAX_GLOBAL_ELEMENT_SIZE];
    for (int i = 0; i < MAX_MATRIX_OUTPUT_MODES; i++) {
        snprintf(dd_output_mode_name, sizeof(dd_output_mode_name), "%s", matrixData.output_mode_names[i]);
        lv_dropdown_add_option(result.dd_output_mode, dd_output_mode_name, LV_DROPDOWN_POS_LAST);
    }
    lv_dropdown_set_selected(result.dd_output_mode, 0);
    lv_obj_add_event_cb(result.dd_output_mode, dd_output_mode_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // Label 
    result.label_port_map = create_label(
        row_port,             // parent
        obj_w_4,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "Pin",                // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    
    // Port Value
    result.val_port_map = create_label(
        row_port,             // parent
        obj_w_4,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "",                // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_subtitle_hue
    );
    lv_obj_add_flag(result.val_port_map, LV_OBJ_FLAG_CLICKABLE);
    lv_obj_add_event_cb(result.val_port_map, set_keyboard_context_cb, LV_EVENT_CLICKED, NULL);
    lv_obj_set_user_data(result.val_port_map, &matrix_port_map_ctx);

    // Critical for alignment
    lv_obj_set_size(result.label_map_slot, obj_w_0, obj_height);
    lv_obj_set_size(result.dd_map_slot, obj_w_1, obj_height);

    lv_obj_set_size(result.label_output_mode, obj_w_2, obj_height);
    lv_obj_set_size(result.dd_output_mode, obj_w_3, obj_height);

    lv_obj_set_size(result.label_port_map, obj_w_4, obj_height);
    lv_obj_set_size(result.val_port_map, obj_w_5, obj_height);

    /* ------------- Intent  ------------------------------- */

    lv_obj_t * row_intent_info = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    lv_obj_set_flex_flow(row_intent_info, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_intent_info,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    obj_w_0 = (((sub_row_width/3) / 2) *1) - (sub_column_padding*1);
    obj_w_1 = ((sub_row_width/3) *1) - (sub_column_padding*1);

    result.indicator_function_non_zero = create_label(
        row_intent_info,      // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "F",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        radius_rounded,       // outline radius
        1,
        default_btn_bg,
        default_value_hue
    );

    result.switch_logic_per_second = create_label(
        row_intent_info,      // parent
        obj_w_0,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "CA",                 // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        radius_rounded,       // outline radius
        1,
        default_btn_bg,
        default_value_hue
    );

    // mapped value
    result.potential_output_value = create_label(
        row_intent_info,      // parent
        obj_w_1,              // width
        obj_height,           // height
        LV_ALIGN_CENTER,      // parent alignment
        0,                    // pos x
        0,                    // pos y
        "0",                  // initial text
        LV_TEXT_ALIGN_CENTER, // font alignment
        &cobalt_alien_17,     // font
        false,                // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        2,                    // outline width
        radius_rounded,       // outline radius
        1,
        default_btn_bg,
        default_value_hue
    );

