holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        // Main style: radius
        lv_obj_set_style_radius(center_rect, 0, LV_PART_MAIN);

        // Main style: outline
        lv_obj_set_style_outline_width(center_rect, 2, LV_PART_MAIN);
        lv_obj_set_style_outline_color(center_rect, lv_color_make(0, 255, 0), LV_PART_MAIN);
        
        // Main style: border
        lv_obj_set_style_border_width(center_rect, 0, LV_PART_MAIN);
        lv_obj_set_style_border_color(center_rect, default_border_hue, LV_PART_MAIN);

        // Main style: background
        lv_obj_set_style_bg_opa(center_rect, LV_OPA_0, LV_PART_MAIN);

        // Main style: shadow
        lv_obj_set_style_shadow_width(center_rect, 0, LV_PART_MAIN);
        lv_obj_set_style_shadow_color(center_rect, default_shadow_hue, LV_PART_MAIN);

        // Remove padding
        lv_obj_set_style_pad_all(center_rect, 0, LV_PART_MAIN);
    }

    // #############################################################################################
    // PITCH TAPE
    // #############################################################################################

    result.pitch_tape_height_px = (size_h_px / 32)*12;
    int32_t pitch_tape_width_px = (size_h_px / 32)*3;

    // ---------------------------------------------------------
    // Create panel
    // ---------------------------------------------------------
    result.pitch_panel = lv_obj_create(result.panel);

    // Container scrolling enabled horizontally
    lv_obj_set_scrollbar_mode(result.pitch_panel, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.pitch_panel, LV_DIR_NONE);
    
    // Size and position
    lv_obj_set_size(result.pitch_panel, pitch_tape_width_px+6, result.pitch_tape_height_px+18);
    lv_obj_align(result.pitch_panel, LV_ALIGN_LEFT_MID, outline_width, 0);

    // Main style: radius
    lv_obj_set_style_radius(result.pitch_panel, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.pitch_panel, 1, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.pitch_panel, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.pitch_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.pitch_panel, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.pitch_panel, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.pitch_panel, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.pitch_panel, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.pitch_panel, 0, LV_PART_MAIN);
    
    // ---------------------------------------------------------
    // Create tape
    // ---------------------------------------------------------
    result.pitch_tape = lv_obj_create(result.pitch_panel);

    // Container scrolling enabled horizontally
    lv_obj_set_scrollbar_mode(result.pitch_tape, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(result.pitch_tape, LV_DIR_HOR);
    
    // Size and position
    lv_obj_set_size(result.pitch_tape, pitch_tape_width_px, result.pitch_tape_height_px);
    lv_obj_align(result.pitch_tape, LV_ALIGN_CENTER, 0, 0);

    // Main style: radius
    lv_obj_set_style_radius(result.pitch_tape, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(result.pitch_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(result.pitch_tape, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(result.pitch_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(result.pitch_tape, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(result.pitch_tape, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(result.pitch_tape, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(result.pitch_tape, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(result.pitch_tape, 0, LV_PART_MAIN);

    // ---------------------------------------------------------
    // Label the tape
    // ---------------------------------------------------------
    lv_obj_t *pitch_label = lv_label_create(result.pitch_tape);

    // Label must not scroll independently
    lv_obj_set_scrollbar_mode(pitch_label, LV_SCROLLBAR_MODE_OFF);
    lv_obj_set_scroll_dir(pitch_label, LV_DIR_NONE);
    lv_obj_clear_flag(pitch_label, LV_OBJ_FLAG_SCROLLABLE);

    // Vertical centering: calculate Y position to center the text (monospace is required for this object)
    // int32_t pitch_font_line_height = lv_font_get_line_height(&Mono_Bold_14) * 1;
    // int32_t pitch_center_y = (pitch_tape_height_px - pitch_font_line_height) / 2;

    // Size label to content width not container width
    lv_obj_set_size(pitch_label, pitch_tape_width_px, LV_SIZE_CONTENT);
    lv_obj_set_pos(pitch_label, 0, 0);

    // Main style: radius
    lv_obj_set_style_radius(pitch_label, 0, LV_PART_MAIN);

    // Main style: outline
    lv_obj_set_style_outline_width(pitch_label, 0, LV_PART_MAIN);
    lv_obj_set_style_outline_color(pitch_label, lv_color_make(0, 255, 0), LV_PART_MAIN);
    
    // Main style: border
    lv_obj_set_style_border_width(pitch_label, 0, LV_PART_MAIN);
    lv_obj_set_style_border_color(pitch_label, default_border_hue, LV_PART_MAIN);

    // Main style: background
    lv_obj_set_style_bg_opa(pitch_label, LV_OPA_0, LV_PART_MAIN);

    // Main style: shadow
    lv_obj_set_style_shadow_width(pitch_label, 0, LV_PART_MAIN);
    lv_obj_set_style_shadow_color(pitch_label, default_shadow_hue, LV_PART_MAIN);

    // Remove padding
    lv_obj_set_style_pad_all(pitch_label, 0, LV_PART_MAIN);

    // Main style: text
    static char pitch_tape_text[181 * 3 * 8 + 1] = {0};
    // Only populate the tape text buffer on first run
    if (pitch_tape_text[0] == '\0') {
        for (int rep = 0; rep < 3; rep++) {
            for (int pitch = 90; pitch >= -90; pitch--) {
                char tmp[16];
                snprintf(tmp, sizeof(tmp), "%+03d\n\n", pitch);
                strcat(pitch_tape_text, tmp);
            }
        }
    }
    // lv_obj_set_style_text_align(pitch_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(pitch_label, &Mono_Bold_14, LV_PART_MAIN);
    lv_obj_set_style_text_color(pitch_label, lv_color_make(0, 255, 0), LV_PART_MAIN);
    lv_label_set_text(pitch_label, pitch_tape_text);
    lv_obj_set_style_text_align(pitch_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);

