holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    result.altitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        -20,                  // pos y
        "ALT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    // result.roll_label = create_label(
    //     result.panel,         // parent
    //     100,                  // width
    //     20,                   // height
    //     LV_ALIGN_BOTTOM_RIGHT, // parent alignment
    //     0,                    // pos x
    //     -40,                  // pos y
    //     "Roll: ",             // initial text
    //     LV_TEXT_ALIGN_RIGHT,  // font alignment
    //     &Mono_Bold_14,     // font
    //     true,                 // transparent background
    //     false,                // show scrollbar
    //     false,                // enable scrolling
    //     0,                    // outline width
    //     general_radius,       // outline radius
    //     1,
    //     default_bg_hue,
    //     default_value_hue
    // );

    // result.pitch_label = create_label(
    //     result.panel,         // parent
    //     100,                  // width
    //     20,                   // height
    //     LV_ALIGN_BOTTOM_RIGHT, // parent alignment
    //     0,                    // pos x
    //     -20,                  // pos y
    //     "PIT ",               // initial text
    //     LV_TEXT_ALIGN_RIGHT,  // font alignment
    //     &Mono_Bold_14,     // font
    //     true,                 // transparent background
    //     false,                // show scrollbar
    //     false,                // enable scrolling
    //     0,                    // outline width
    //     general_radius,       // outline radius
    //     1,
    //     default_bg_hue,
    //     default_value_hue
    // );

    // result.yaw_label = create_label(
    //     result.panel,         // parent
    //     100,                  // width
    //     20,                   // height
    //     LV_ALIGN_BOTTOM_RIGHT, // parent alignment
    //     0,                    // pos x
    //     0,                    // pos y
    //     "YAW ",               // initial text
    //     LV_TEXT_ALIGN_RIGHT,  // font alignment
    //     &Mono_Bold_14,     // font
    //     true,                 // transparent background
    //     false,                // show scrollbar
    //     false,                // enable scrolling
    //     0,                    // outline width
    //     general_radius,       // outline radius
    //     1,
    //     default_bg_hue,
    //     default_value_hue
    // );

    return result;
}


/** -------------------------------------------------------------------------------------
 * @brief Create Image Loaded from SD Card.
 *
 * @param parent Specify parent object.
 * @param filename Path/filename on SD card.
 * @param width_px Display width.
 * @param height_px Display height.
 * @param color_depth_bits Color depth (16, 32, etc.).
 * @param pos_x Offset from alignment.
 * @param pos_y Offset from alignment.
 * @param alignment Image alignment on parent.
 * @param discard_after_display Free image data after first display (memory optimization).
 * @return sdcard_image_t* Pointer to image info structure (or NULL on failure).
 */
sdcard_image_t * create_image_from_sdcard(
    lv_obj_t * parent,
    const char * filename,
    uint32_t width_px,
    uint32_t height_px,
    uint32_t color_depth_bits,
    uint32_t pos_x,
    uint32_t pos_y,
    lv_align_t alignment,
    bool discard_after_display
) {

    // Allocate sdcard_image_t structure
    sdcard_image_t * sdcard_image = (sdcard_image_t *)heap_caps_malloc(sizeof(sdcard_image_t), MALLOC_CAP_SPIRAM);
    if (!sdcard_image) {
        printf("ERROR: PSRAM allocation for sdcard_image_t failed\n");
        return NULL;
    }

    // Get file size
    sdcard_image->f_size = get_file_size(filename);
    if (sdcard_image->f_size == 0) {
        printf("ERROR: Cannot get size of %s\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Load image to PSRAM
    sdcard_image->bytes_in_psram = load_file_bytes_to_psram(filename, sdcard_image->f_size);
    if (!sdcard_image->bytes_in_psram) {
        printf("ERROR: Failed to load %s to PSRAM\n", filename);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Create descriptor from loaded data
    sdcard_image->dsc.header.cf = color_depth_bits == 24 ? LV_COLOR_FORMAT_RGB565A8 : LV_COLOR_FORMAT_RGB565;
    sdcard_image->dsc.header.w = width_px;
    sdcard_image->dsc.header.h = height_px;
    sdcard_image->dsc.data_size = sdcard_image->f_size;
    sdcard_image->dsc.data = sdcard_image->bytes_in_psram; // Pointer to PSRAM data

    printf("Created image descriptor: cf=%d %ldx%ld size=%ld\n", 
           sdcard_image->dsc.header.cf, width_px, height_px, sdcard_image->f_size);

    // Create LVGL image object
    sdcard_image->lv_image_obj = lv_img_create(parent);
    if (!sdcard_image->lv_image_obj) {
        printf("ERROR: Failed to create LVGL image\n");
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Position and size
    lv_obj_set_pos(sdcard_image->lv_image_obj, pos_x, pos_y);
    if (alignment == LV_ALIGN_CENTER) {
        lv_obj_center(sdcard_image->lv_image_obj);
    }
    lv_obj_set_size(sdcard_image->lv_image_obj, width_px, height_px);
    
