holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    lv_scr_load(loading_screen);
}

/** -------------------------------------------------------------------------------------
 * @brief Show Home Screen.
 */
void display_home_screen()
{
    // Set Display Flag
    printf("[display_home_screen] setting display flag\n");
    flag_display_home_screen = false;

    // Check Current Screen
    printf("[display_home_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == home_screen) {
        printf("[display_home_screen] screen already active, returning\n");
        return;
    }
    printf("[display_home_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = HOME_SCREEN;

    // Always create a fresh screen
    printf("[display_home_screen] creating screen object\n");
    home_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_home_screen] loading screen\n");
    lv_scr_load_anim(home_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_home_screen] creating default screen objects\n");
    create_default_screen_objects(home_screen);

    printf("[display_home_screen] invalidating display\n");
    lv_obj_invalidate(home_screen);  // Force redraw
    printf("[display_home_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // -------------------------------- Astro Clock ----------------------------------- //

    // Initialize astro clock on main screen
    printf("[display_home_screen] starting astro clocks\n");
    astro_clock_begin(
        home_screen,
        550,             // outline width (total available width)
        550,             // outline height (total available height)
        550,             // astro width (span X of total available width)
        550,             // astro height (span Y of total available height)
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        90               // angle offset
    );

    printf("[display_home_screen] invalidating display\n");
    lv_obj_invalidate(home_screen);  // Force redraw
    printf("[display_home_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show Matrix Screen.
 */
void display_matrix_screen()
{
    // Set Display Flag
    printf("[display_matrix_screen] setting display flag\n");
    flag_display_matrix_screen = false;

    // Check Current Screen
    printf("[display_matrix_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == matrix_screen) {
        printf("[display_matrix_screen] screen already active, returning\n");
        return;
    }
    printf("[display_matrix_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = MATRIX_SCREEN;

    // Always create a fresh screen
    printf("[display_matrix_screen] creating screen object\n");
    matrix_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_matrix_screen] loading screen\n");
    lv_scr_load_anim(matrix_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_matrix_screen] creating default screen objects\n");
    create_default_screen_objects(matrix_screen);

    printf("[display_matrix_screen] invalidating display\n");
    lv_obj_invalidate(matrix_screen);  // Force redraw
    printf("[display_matrix_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    current_mapping_i = 0;
    current_matrix_i = 0;
    current_matrix_function_i = 0;

    matrix_overview_grid_1 = create_menu_grid(
        matrix_screen,        // parent screen
        15,                   // cols
        3,                    // rows
        38,                   // cell size px
        8,                    // outer padding
        8,                    // inner padding
        0,                    // pos x
        0,                    // pos y
        LV_ALIGN_CENTER,      // alignment
        radius_rounded,       // item radius px
        15,                   // max cols visible (for scrollbar)
        3,                    // max rows visible (for scrollbar)
        false,                // show scrollbar
        false,                // enable scrolling
        LV_TEXT_ALIGN_CENTER, // text align
        &cobalt_alien_17,     // font for labels
        true,
        false
    );
    // Plug in general event callback handler
    uint32_t grid_menu_x_count = lv_obj_get_child_cnt(matrix_overview_grid_1);
    for(uint32_t i = 0; i < grid_menu_x_count; i++) {
        lv_obj_t * btn = lv_obj_get_child(matrix_overview_grid_1, i);
        lv_obj_add_event_cb(btn, matrix_overview_grid_1_event_cb, LV_EVENT_CLICKED, NULL);
    }

    printf("[display_matrix_screen] invalidating display\n");
    lv_obj_invalidate(matrix_screen);  // Force redraw
    printf("[display_matrix_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Create Function Panel
    mfc = create_matrix_function_container(
        matrix_screen,    // parent
        520,              // width px
        410,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        35,               // pos y
        radius_rounded,   // radius
        0,                // outer_pad_all
        4,                // inner_pad_all
        0,                // outline_padding
        1,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        40,               // row height
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );
    lv_obj_add_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);

