holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    vTaskDelay(5 / portTICK_PERIOD_MS);

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gps_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show Gyro Screen.
 */
void display_gyro_screen()
{
    // Set Display Flag
    printf("[display_gyro_screen] setting display flag\n");
    flag_display_gyro_screen = false;

    // Check Current Screen
    printf("[display_gyro_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gyro_screen) {
        printf("[display_gyro_screen] screen already active, returning\n");
        return;
    }
    printf("[display_gyro_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = GYRO_SCREEN;

    // Always create a fresh screen
    printf("[display_gyro_screen] creating screen object\n");
    gyro_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_gyro_screen] loading screen\n");
    lv_scr_load_anim(gyro_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_gyro_screen] creating default screen objects\n");
    create_default_screen_objects(gyro_screen);

    printf("[display_gyro_screen] invalidating display\n");
    lv_obj_invalidate(gyro_screen);  // Force redraw
    printf("[display_gyro_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Gyro
    gyro_0_c = create_gyro_panel(
        gyro_screen,      // parent
        650,              // width px
        (general_menu_row_h_px*5)-(outline_width*2)-(2*2), // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        general_menu_row_h_px, // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    // Calibrate Gyro -> Button starts timer -> calibration ends on timeout.

    // Calibrate Magnetic Field -> Button starts timer -> calibration ends on timeout.

    printf("[display_gps_screen] invalidating display\n");
    lv_obj_invalidate(gyro_screen);  // Force redraw
    printf("[display_gps_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show System Settings Screen.
 */
void display_mplex0_screen()
{
    // Set Display Flag
    printf("[display_mplex0_screen] setting display flag\n");
    flag_display_mplex0_screen = false;

    // Check Current Screen
    printf("[display_mplex0_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == mplex0_screen) {
        printf("[display_mplex0_screen] screen already active, returning\n");
        return;
    }
    printf("[display_mplex0_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = MPLEX0_SCREEN;

    // Always create a fresh screen
    printf("[display_mplex0_screen] creating screen object\n");
    mplex0_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_mplex0_screen] loading screen\n");
    lv_scr_load_anim(mplex0_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_mplex0_screen] creating default screen objects\n");
    create_default_screen_objects(mplex0_screen);

    printf("[display_mplex0_screen] invalidating display\n");
    lv_obj_invalidate(mplex0_screen);  // Force redraw
    printf("[display_mplex0_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Admplex 0
    admlpex0_c = create_admplex0_panel(
        mplex0_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    printf("[display_mplex0_screen] invalidating display\n");
    lv_obj_invalidate(mplex0_screen);  // Force redraw
    printf("[display_mplex0_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show Serial Screen.
 */
void display_serial_screen()
{
    // Set Display Flag
    printf("[display_serial_screen] setting serial flag\n");
    flag_display_serial_screen = false;

    // Check Current Screen
    printf("[display_serial_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == serial_screen) {
        printf("[display_serial_screen] screen already active, returning\n");
        return;
    }
    printf("[display_serial_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = SERIAL_SCREEN;

