holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Always create a fresh screen
    printf("[display_serial_screen] creating screen object\n");
    serial_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_serial_screen] loading screen\n");
    lv_scr_load_anim(serial_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_serial_screen] creating default screen objects\n");
    create_default_screen_objects(serial_screen);

    printf("[display_serial_screen] invalidating display\n");
    lv_obj_invalidate(serial_screen);  // Force redraw
    printf("[display_serial_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // Serial
    serial_c = create_serial_panel(
        serial_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    printf("[display_serial_screen] invalidating display\n");
    lv_obj_invalidate(serial_screen);  // Force redraw
    printf("[display_serial_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Show UAP Screen.
 */
void display_uap_screen()
{
    // Set Display Flag
    printf("[display_uap_screen] setting display flag\n");
    flag_display_uap_screen = false;

    // Check Current Screen
    printf("[display_uap_screen] checking sctive screen\n");
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == uap_screen) {
        printf("[display_uap_screen] screen already active, returning\n");
        return;
    }
    printf("[display_uap_screen] selected new screen, attempting to load new screen\n");

    current_screen_number = UAP_SCREEN;

    // Always create a fresh screen
    printf("[display_uap_screen] creating screen object\n");
    uap_screen = lv_obj_create(NULL);
    
    // Load screen before creating more objects (smoother, faster load)
    printf("[display_uap_screen] loading screen\n");
    lv_scr_load_anim(uap_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    printf("[display_uap_screen] creating default screen objects\n");
    create_default_screen_objects(uap_screen);

    printf("[display_uap_screen] invalidating display\n");
    lv_obj_invalidate(uap_screen);  // Force redraw
    printf("[display_uap_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render

    // create UAP
    uap_c = create_uap(
        uap_screen,
        500,
        500,
        LV_ALIGN_CENTER,
        0,
        0,
        general_radius
    );

    printf("[display_serial_screen] invalidating display\n");
    lv_obj_invalidate(serial_screen);  // Force redraw
    printf("[display_serial_screen] calling timer handler\n");
    lv_timer_handler();  // Process events/render
}

/** -------------------------------------------------------------------------------------
 * @brief Timer runs update_display function.
 */

int64_t ui_timing_second   = 0;
bool ui_timing_second_flag = false;

int64_t ui_timing_half_second   = 0;
bool ui_timing_half_second_flag = false;

void update_display_on_timer(lv_timer_t * timer) {
    LV_UNUSED(timer);

    ui_timing_second_flag=false;
    if
    (
        satioData.local_unixtime_uS >= (ui_timing_second + 1000000) ||
        satioData.local_unixtime_uS <= (ui_timing_second - 1000000)
    )
    {
        ui_timing_second=satioData.local_unixtime_uS;
        ui_timing_second_flag=true;
    }

    ui_timing_half_second_flag=false;
    if
    (
        satioData.local_unixtime_uS >= (ui_timing_half_second + 500000) ||
        satioData.local_unixtime_uS <= (ui_timing_half_second - 500000)
    )
    {
        ui_timing_half_second=satioData.local_unixtime_uS;
        ui_timing_half_second_flag=true;
    }

    update_display();
    systemData.i_count_display++;
};

/** -------------------------------------------------------------------------------------
 * @brief Main function to update screen objects and load screens.
 */
void update_display()
{

    // Pause timer
    lv_timer_pause(display_timer);

    // ---------------------
    // Rainbow Effect
    // ---------------------
    current_hue = (current_hue + 1) % 360;
    // Rainbow Major
    rainbow_outline_hue = lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100);
    rainbow_title_hue   = lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100);
    rainbow_value_hue   = lv_color_hsv_to_rgb((current_hue + 200) % 360, 100, 100);
    // Rainbow Minor
    rainbow_contrast_outline_hue = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);
    rainbow_contrast_title_hue   = lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100);
    rainbow_contrast_value_hue   = lv_color_hsv_to_rgb((current_hue + 50) % 360, 100, 100);

    // ---------------------
    // Check Load Screen Flags
    // ---------------------
    if (flag_display_home_screen==true) {display_home_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_matrix_screen==true) {display_matrix_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_gps_screen==true) {display_gps_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_gyro_screen==true) {display_gyro_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_mplex0_screen==true) {display_mplex0_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_serial_screen==true) {display_serial_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    else if (flag_display_uap_screen==true) {display_uap_screen(); vTaskDelay(5 / portTICK_PERIOD_MS);}
    
    // ---------------------
    // KB Alnumsym
    // ---------------------
    if (kb_alnumsym.kb != NULL && lv_obj_is_valid(kb_alnumsym.kb)) {
        if (!lv_obj_has_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard full outline
            lv_obj_set_style_outline_color(kb_alnumsym.kb, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard full keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, rainbow_title_hue, LV_PART_ITEMS);
            // Rainbow keyboard full checked keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, rainbow_value_hue, LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard full text area outline
            lv_obj_set_style_outline_color(kb_alnumsym.ta, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard full text area text
            lv_obj_set_style_text_color(kb_alnumsym.ta, rainbow_value_hue, LV_PART_MAIN);
        }
    }
    // ---------------------
    // KB Numdedc
    // ---------------------
    if (kb_numdec.kb != NULL && lv_obj_is_valid(kb_numdec.kb)) {
        if (!lv_obj_has_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard numdec full outline
            lv_obj_set_style_outline_color(kb_numdec.kb, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard numdec full keys
            lv_obj_set_style_text_color(kb_numdec.kb, rainbow_title_hue, LV_PART_ITEMS);
            // Rainbow keyboard numdec full checked keys
            lv_obj_set_style_text_color(kb_numdec.kb, rainbow_value_hue, LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard numdec full text area outline
            lv_obj_set_style_outline_color(kb_numdec.ta, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard numdec full text area text
            lv_obj_set_style_text_color(kb_numdec.ta, rainbow_value_hue, LV_PART_MAIN);
        }
    }
    
    // ---------------------
    // Title Bar
    // ---------------------
    if (main_title_bar.panel) {
        vTaskDelay(5 / portTICK_PERIOD_MS);

        // Title Bar Outline
        lv_obj_set_style_outline_color(main_title_bar.panel, rainbow_outline_hue, LV_PART_MAIN);

        // Title Bar Local Time
        lv_label_set_text(main_title_bar.time_label, satioData.formatted_local_time_HHMMSS);
        lv_obj_set_style_text_color(main_title_bar.time_label, rainbow_title_hue, LV_PART_MAIN);

        // Title Bar Local Date
        lv_label_set_text(main_title_bar.date_label, satioData.formatted_local_short_date_DDMMYY);
        lv_obj_set_style_text_color(main_title_bar.date_label, rainbow_title_hue, LV_PART_MAIN);

        // GPS Sync
        if (satioData.gps_sync) {
            lv_obj_add_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_style_outline_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
        }
        // GPS Signal
        else {
            lv_obj_add_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            String gps_signal_text = "" + String(gnggaData.satellite_count) + ":" + String(gnggaData.gps_precision_factor) + "";
            lv_obj_set_style_outline_color(main_title_bar.gps_signal_strength, rainbow_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.gps_signal_strength, rainbow_contrast_title_hue, LV_PART_MAIN);
            lv_label_set_text(main_title_bar.gps_signal_strength, gps_signal_text.c_str());
        }

        // SD Card Mounted / Success Flag
        if (sdcardFlagData.success_flag==2) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "ok");
        }
        else if (sdcardFlagData.success_flag==1) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "!");
        }
        else {
            if (sdcardData.sdcard_mounted) {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, rainbow_contrast_title_hue, LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD");
            }
            else {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, rainbow_contrast_title_hue, LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD!");
            }
        }
    }

    // ---------------------
    // System Tray
    // ---------------------
    if (system_tray.is_open) {
        vTaskDelay(5 / portTICK_PERIOD_MS);

        // Rainbow System Tray Outline
        lv_obj_set_style_outline_color(system_tray.panel, rainbow_outline_hue, LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Outline
        lv_obj_set_style_outline_color(system_tray.slider_brightness, rainbow_contrast_outline_hue, LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Knob
        lv_obj_set_style_bg_color(system_tray.slider_brightness, rainbow_contrast_value_hue, LV_PART_KNOB);

        // Rainbow System Tray Brightness Slider Indicator
        lv_obj_set_style_outline_color(system_tray.slider_brightness, rainbow_contrast_outline_hue, LV_PART_INDICATOR);

