holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                // ────────────────────────────────────────────────
                // GPS Speed
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_speed, String(satioData.speed, 2).c_str());

                // ────────────────────────────────────────────────
                // User Speed
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_user_speed, String(satioData.user_speed, 2).c_str());

                // ────────────────────────────────────────────────
                // System Speed
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_speed, String(satioData.system_speed, 2).c_str());

                // ────────────────────────────────────────────────
                // Speed Value Mode
                // ────────────────────────────────────────────────
                if (satioData.speed_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_user.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_gps.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.speed_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_gps.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_gps.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_gps.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_speed_mode_user.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_speed_mode_user.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_speed_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

                // ────────────────────────────────────────────────
                // Ground Heading Name
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_ground_heading_name, String(satioData.ground_heading_name).c_str());

                // ────────────────────────────────────────────────
                // GPS Ground Heading
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_ground_heading, String(satioData.ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // User Ground Heading
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_user_ground_heading, String(satioData.user_ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // System Ground Heading
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_ground_heading, String(satioData.system_ground_heading, 2).c_str());

                // ────────────────────────────────────────────────
                // Ground Heading Value Mode
                // ────────────────────────────────────────────────
                if (satioData.ground_heading_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_user.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.ground_heading_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_gps.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_gps.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_ground_heading_mode_user.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_ground_heading_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }

