holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                vTaskDelay(5 / portTICK_PERIOD_MS);

                // ────────────────────────────────────────────────
                // Mileage
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_mileage, String(satioData.mileage).c_str());

                // ────────────────────────────────────────────────
                // LMST Time
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_LMST_time, String(satioData.formatted_LMST_time).c_str());

                // ────────────────────────────────────────────────
                // LMST Date
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_LMST_date, String(satioData.formatted_LMST_date_DDMMYYYY).c_str());

                // ────────────────────────────────────────────────
                // LMST Daylight Hours
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_LMST_day_hours, String(satioData.LMST_twilight_schedule.LMST_day_hours).c_str());

                // ────────────────────────────────────────────────
                // LMST Night Hours
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_LMST_night_hours, String(satioData.LMST_twilight_schedule.LMST_night_hours).c_str());

                // ────────────────────────────────────────────────
                // LMST Anomaly
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_LMST_anomaly, String(satioData.LMST_twilight_schedule.LMST_anomaly).c_str());

                // ────────────────────────────────────────────────
                // LMST Current Twilight Zone Name
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_current_twilight_zone_name, String(twilight_zone_names[satioData.LMST_twilight_schedule.current_zone]).c_str());

                // ────────────────────────────────────────────────
                // LMST Astronomical Twilight Dawn
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_astronomical_twilight_dawn,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[AstronomicalTwilight]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dawn_end[AstronomicalTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Nautical Twilight Dawn
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_nautical_twilight_dawn,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[NauticalTwilight]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dawn_end[NauticalTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Civil Twilight Dawn
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_civil_twilight_dawn,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[CivilTwilight]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dawn_end[CivilTwilight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Sunrise
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_sunrise,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[SunriseSunset]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dawn_end[SunriseSunset])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Full Daylight
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_FullDayLight,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[FullDaylight]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dusk_end[FullDaylight])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Golden Hour Dawn
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_golden_hour_dawn,
                    String(
                        String(satioData.LMST_twilight_schedule.dawn_start[GoldenHour]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dawn_end[GoldenHour])
                    ).c_str()
                );

                // ────────────────────────────────────────────────
                // LMST Golden Hour Dusk
                // ────────────────────────────────────────────────
                lv_label_set_text(
                    satio_c.val_LMST_golden_hour_dusk,
                    String(
                        String(satioData.LMST_twilight_schedule.dusk_start[GoldenHour]) +
                        String(" - ") +
                        String(satioData.LMST_twilight_schedule.dusk_end[GoldenHour])
                    ).c_str()
                );

