holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
                lv_label_set_text(gpatt_c.val_user_code, String(gpattData.user_code).c_str());

                lv_label_set_text(gpatt_c.val_gst_data, String(gpattData.gst_data).c_str());

                lv_label_set_text(gpatt_c.val_line_flag, String(gpattData.line_flag).c_str());

                lv_label_set_text(gpatt_c.val_mis_att_flag, String(gpattData.mis_att_flag).c_str());

                lv_label_set_text(gpatt_c.val_imu_kind, String(gpattData.imu_kind).c_str());

                lv_label_set_text(gpatt_c.val_ubi_car_kind, String(gpattData.ubi_car_kind).c_str());

                lv_label_set_text(gpatt_c.val_mileage, String(gpattData.mileage).c_str());

                lv_label_set_text(gpatt_c.val_run_inetial_flag, String(gpattData.run_inetial_flag).c_str());

                lv_label_set_text(gpatt_c.val_speed_num, String(gpattData.speed_num).c_str());

                lv_label_set_text(gpatt_c.val_scalable, String(gpattData.scalable).c_str());

                lv_label_set_text(gpatt_c.val_bad_element_count, String(gpattData.total_bad_elements).c_str());
            }
        }
    }

    // ---------------------
    // Gyro screen
    // ---------------------
    else if (current_screen_number == GYRO_SCREEN) {
        if (gyro_0_c.panel) {

            // ────────────────────────────────────────────────
            // Angular
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_x, String(gyroData.gyro_0_ang_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_y, String(gyroData.gyro_0_ang_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_ang_z, String(gyroData.gyro_0_ang_z).c_str());

            // ────────────────────────────────────────────────
            // Acceleration
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_x, String(gyroData.gyro_0_acc_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_y, String(gyroData.gyro_0_acc_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_z, String(gyroData.gyro_0_acc_z).c_str());

            // ────────────────────────────────────────────────
            // Gyroscope 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_x, String(gyroData.gyro_0_gyr_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_y, String(gyroData.gyro_0_gyr_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_z, String(gyroData.gyro_0_gyr_z).c_str());

            // ────────────────────────────────────────────────
            // Magnetometer 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_x, String(gyroData.gyro_0_mag_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_y, String(gyroData.gyro_0_mag_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_z, String(gyroData.gyro_0_mag_z).c_str());

            // ────────────────────────────────────────────────
            // Current UI Baud Rate
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_current_uiBaud, String(gyroData.gyro_0_current_uiBaud).c_str());
        }
    }

    // ---------------------
    // MPlex screen
    // ---------------------
    else if (current_screen_number == MPLEX0_SCREEN) {
        if (admlpex0_c.panel) {
            lv_label_set_text(admlpex0_c.lbl_val_chan_0,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_0]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_1,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_1]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_2,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_2]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_3,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_3]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_4,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_4]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_5,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_5]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_6,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_6]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_7,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_7]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_8,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_8]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_9,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_9]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_10, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_10]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_11, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_11]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_12, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_12]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_13, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_13]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_14, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_14]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_15, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_15]).c_str());
        }
    }

    // ---------------------
    // UAP screen
    // ---------------------
    else if (current_screen_number == UAP_SCREEN) {
        
        // ────────────────────────────────────────────────
        // Roll
        // ────────────────────────────────────────────────
        if (uap_c.roll_panel) {
            lv_obj_set_style_transform_rotation(uap_c.roll_panel, (int32_t)gyroData.gyro_0_ang_x*10, LV_PART_MAIN);
        }

        // ────────────────────────────────────────────────
        // Pitch
        // ────────────────────────────────────────────────
        if (uap_c.pitch_tape) {
            // Pitch tape: "%+03d\n\n" per entry = exactly 2 line-heights each.
            // Derive entry_h from the font directly to avoid any measured-height drift.
            float pitch_val = gyroData.gyro_0_ang_y;
            if (pitch_val > 90.0f) pitch_val = 90.0f;
            if (pitch_val < -90.0f) pitch_val = -90.0f;
            const int32_t line_h   = lv_font_get_line_height(&Mono_Bold_14);
            const int32_t entry_h  = 2 * line_h;          // 2 lines per "%+03d\n\n"
            const int32_t cycle_px = 181 * entry_h;       // exact offset to 2nd repeat
            float index = 90.0f - pitch_val;              // 0=+90, 180=-90
            // Center viewport on the middle of the text line (top line of entry)
            int32_t center_pos = cycle_px + (int32_t)(index * entry_h) + line_h / 2;
            int32_t scroll_y = center_pos - uap_c.pitch_tape_height_px / 2;
            lv_obj_scroll_to_y(uap_c.pitch_tape, scroll_y, LV_ANIM_OFF);
        }

