holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
        // ────────────────────────────────────────────────
        // Yaw
        // ────────────────────────────────────────────────
        if (uap_c.gh_tape) {
            // Convert from [-180, 180] to [0, 360]
            float angle_0_360 = fmod(gyroData.gyro_0_ang_z + 360.0f, 360.0f);
            float normalized = angle_0_360 / 360.0f;
            int32_t one_cycle_width = uap_c.gh_tape_content_width_px / 3;
            float degree_width = (float)uap_c.gh_tape_content_width_px / 1080.0f;
            float center_pos = one_cycle_width + normalized * one_cycle_width + degree_width / 2.0f;
            int32_t scroll_x = (int32_t)(center_pos - (uap_c.gh_tape_width_px / 2.0f));
            lv_obj_scroll_to_x(uap_c.gh_tape, scroll_x, LV_ANIM_OFF);
        }

        lv_label_set_text(uap_c.latitude_label, String("LAT " + String(satioData.degrees_latitude, 7)).c_str());
        lv_label_set_text(uap_c.longitude_label, String("LON " + String(satioData.degrees_longitude, 7)).c_str());
        lv_label_set_text(uap_c.altitude_label, String("ALT " + String(satioData.altitude, 2)).c_str());
        lv_label_set_text(uap_c.speed_label, String("SPD " + String(satioData.speed, 2)).c_str());

        // lv_label_set_text(uap_c.roll_label, String("ROL " + String(gyroData.gyro_0_ang_x, 2)).c_str());
        // lv_label_set_text(uap_c.pitch_label, String("PIT " + String(gyroData.gyro_0_ang_y, 2)).c_str());
        // lv_label_set_text(uap_c.yaw_label, String("YAW " + String(gyroData.gyro_0_ang_z, 2)).c_str());
    }

    lv_timer_resume(display_timer);
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to default color scheme
 */
void setColorsDefault()
{
    main_bg_hue      = default_bg_hue;
    main_outline_hue = default_outline_hue;
    main_border_hue  = default_border_hue;
    main_shadow_hue  = default_shadow_hue;
    main_title_hue   = default_title_hue;
    main_value_hue   = default_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to custom color scheme
 */
void setColorsCustom()
{
    main_bg_hue      = custom_bg_hue;
    main_outline_hue = custom_outline_hue;
    main_border_hue  = custom_border_hue;
    main_shadow_hue  = custom_shadow_hue;
    main_title_hue   = custom_title_hue;
    main_value_hue   = custom_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Initialize LVGL for this device.
 */
void initSatIOUI() {
    // --------------------------------------------------------------
    // LVGL Initialization
    // --------------------------------------------------------------
    ESP_LOGI("LVGL", "Version: %d.%d.%d", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);

    delay(1000);
    
    // Initialize LVGL display object via BSP
    lv_display_t *disp = bsp_display_start();
    if (!disp) {ESP_LOGE("APP", "Failed to initialize display");}
    ESP_LOGI("APP", "Display initialized successfully");
    
    // Give BSP task time to fully initialize LVGL
    vTaskDelay(pdMS_TO_TICKS(1000));

    // Set LVGL tick period
    lv_timer_set_period(lv_timer_get_next(NULL), 10);  // ms
    
    // Initialize display brightness and backlight
    bsp_display_brightness_init();
    bsp_display_backlight_on();
    slider_brightness_value = 80;
    bsp_display_brightness_set(slider_brightness_value);

    // Create Screen Objects
    loading_screen = lv_obj_create(NULL);
    home_screen    = lv_obj_create(NULL);
    matrix_screen  = lv_obj_create(NULL);
    gps_screen     = lv_obj_create(NULL);
    gyro_screen    = lv_obj_create(NULL);
    serial_screen  = lv_obj_create(NULL);
    mplex0_screen  = lv_obj_create(NULL);
    uap_screen     = lv_obj_create(NULL);

    // Default
    default_bg_hue                  = lv_color_make(0,0,0);
    default_bg_title_hue            = lv_color_make(12,12,12);
    default_outline_hue             = lv_color_make(28,28,28);
    default_border_hue              = lv_color_make(0,0,0);
    default_shadow_hue              = lv_color_make(0,0,0);
    default_title_hue               = lv_color_make(255,0, 0);
    default_subtitle_hue            = lv_color_make(0,0, 255);
    default_value_hue               = lv_color_make(0,255,0);

    // Default Button
    default_btn_bg                  = lv_color_make(12,12,12);
    default_btn_outline_hue         = lv_color_make(28,28,28);
    default_btn_border_hue          = lv_color_make(0,0,0);
    default_btn_shadow_hue          = lv_color_make(0,0,0);
    default_btn_value_hue           = lv_color_make(42,42,42);
    // Default Button Off
    default_btn_off_bg              = lv_color_make(0,0,0);
    default_btn_off_outline_hue     = lv_color_make(28,28,28);
    default_btn_off_border_hue      = lv_color_make(0,0,0);
    default_btn_off_shadow_hue      = lv_color_make(0,0,0);
    default_btn_off_value_hue       = lv_color_make(42,42,42);
    // Default Button On
    default_btn_on_bg               = lv_color_make(12,12,12);
    default_btn_on_outline_hue      = lv_color_make(28,28,28);
    default_btn_on_border_hue       = lv_color_make(0,0,0);
    default_btn_on_shadow_hue       = lv_color_make(0,0,0);
    default_btn_on_value_hue        = lv_color_make(0,255,0);
    // Default Button Toggle
    default_btn_toggle_outline_hue  = lv_color_make(28,28,28);
    default_btn_toggle_value_hue    = lv_color_make(0,0,255);

    // Default Switch
    default_sw_off_bg               = lv_color_make(28, 28, 28);
    default_sw_off_knob_bg          = lv_color_make(0, 0, 255);
    default_sw_on_bg                = lv_color_make(32, 32, 32);
    default_sw_on_knob_bg           = lv_color_make(0, 255, 0);

    // Custom (intended to be changed by user -> sets main_hue)
    // custom_bg_hue                = lv_color_make(0,0,0);
    // custom_title_bg_hue          = lv_color_make(12,12,12);
    // custom_outline_hue           = lv_color_make(0,0,0);
    // custom_border_hue            = lv_color_make(0,0,0);
    // custom_shadow_hue            = lv_color_make(0,0,0);
    // custom_title_hue             = lv_color_make(0,0, 255);
    // custom_subtitle_hue          = lv_color_make(0,0, 255);
    // custom_value_hue             = lv_color_make(0,255,0);

    // Rainbow Hue Major
    rainbow_outline_hue          = lv_color_make(0,0,0);
    rainbow_title_hue            = lv_color_make(0,0,255);
    rainbow_value_hue            = lv_color_make(0,255,0);
    // Rainbow Hue Minor
    rainbow_contrast_outline_hue = lv_color_make(0,0,0);
    rainbow_contrast_title_hue   = lv_color_make(0,0,255);
    rainbow_contrast_value_hue   = lv_color_make(0,255,0);

    // Set Current Pallette
    setColorsDefault();

    // --------------------------------------------------------------
    // SD Card Initialization
    // --------------------------------------------------------------
    mount_sd();
    
    is_fs_ready("/sdcard"); // check mount
    
    list_directory("/sdcard"); // check read sdcard
    
    delay(1000);

    sd_lvgl_register(); // register file related callback functions with LVGL

    // --------------------------------------------------------------
    // Display Loading Screen
    // --------------------------------------------------------------
    display_loading_screen();
}

/** -------------------------------------------------------------------------------------
 * @brief Start's Update Display Timer.
 */
void satio_ui_begin() {
    display_timer = lv_timer_create(update_display_on_timer, 10, NULL);
}
